|Variable|Definition|Key|
|---|---|---|
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|gender|gender ||
|Age |Age in years| |
|sibsp |number of siblings / spouses aboard|	|
|parch |number of parents / children aboard| |
|ticket|Ticket number ||
|fare | fare| 	|
|cabin |Cabin number|	|
|embarked|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|
|boat | Lifeboat||
|body | Body Identification Number||
|home.dest| Home/destination||

- Read data and describe it
- Find columns with missingdata
- Print shape of dataset
- drop columns with more than 25% missing data
- drop columns having independent values(which do not affect the survival rate).


- check data types of all columns
- convert fare to numeric
- find columns still having missing/na values and also count of missing data
- fill na with mean for fare and age column column.
- drop rows where na values are present in embarked column.
- dump the dataframe to a csv file 'titanic_filtered.csv'.


- for surviced column replace 0 with D and 1 with A
- find the frequency of different values in survived column
- group by gender and survived and see the counts in each category
- find different pclass and no of people in each class

- find top 5 people with highest values of age. Count no of male and females in the top 5
- find max age male and female who survived
- get average age by gender
- get average age by people survived vs not-survived

In [3]:
import pandas as pd
df = pd.read_csv("titanic_dataset.csv",index_col=0)
print(df.head())

   pclass  survived                                             name  gender  \
0       1         1                    Allen, Miss. Elisabeth Walton  female
1       1         1                   Allison, Master. Hudson Trevor    male
2       1         0                     Allison, Miss. Helen Loraine  female
3       1         0             Allison, Mr. Hudson Joshua Creighton    male
4       1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female

       age  sibsp  parch  ticket      fare    cabin embarked boat   body  \
0  29.0000      0      0   24160  $211.34        B5        S    2    NaN
1   0.9167      1      2  113781  $151.55   C22 C26        S   11    NaN
2   2.0000      1      2  113781  $151.55   C22 C26        S  NaN    NaN
3  30.0000      1      2  113781  $151.55   C22 C26        S  NaN  135.0
4  25.0000      1      2  113781  $151.55   C22 C26        S  NaN    NaN

                         home.dest
0                     St Louis, MO
1  Montreal, PQ / Chesterville, ON
2  Montreal, PQ / Chesterville, ON
3  Montreal, PQ / Chesterville, ON
4  Montreal, PQ / Chesterville, ON

In [4]:
df.columns[df.isnull().any()]

Index(['age', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'], dtype='object')

In [5]:
df.shape

(1309, 14)

In [6]:
df.dropna(axis=1,how="any",thresh=df.shape[0]*0.75,inplace=True)

In [7]:
df.shape

(1309, 10)

In [8]:
print(df.dtypes)

pclass        int64
survived      int64
name         object
gender       object
age         float64
sibsp         int64
parch         int64
ticket       object
fare         object
embarked     object
dtype: object

In [9]:
df.fare=df.fare.str.replace("$","")
print (df['fare'])

0       211.34
1       151.55
2       151.55
3       151.55
4       151.55
         ...
1304     14.45
1305     14.45
1306      7.23
1307      7.23
1308      7.88
Name: fare, Length: 1309, dtype: object

In [10]:
df.fare =  df.fare.astype("float64")
print (df.fare)

0       211.34
1       151.55
2       151.55
3       151.55
4       151.55
         ...
1304     14.45
1305     14.45
1306      7.23
1307      7.23
1308      7.88
Name: fare, Length: 1309, dtype: float64

In [11]:
df.isna().sum()

pclass        0
survived      0
name          0
gender        0
age         263
sibsp         0
parch         0
ticket        0
fare          1
embarked      2
dtype: int64

In [12]:
df.fillna({"age":df.age.mean(),"fare":df.fare.mean()},inplace=True)

In [13]:
df.dropna

<bound method DataFrame.dropna of       pclass  survived                                             name  \
0          1         1                    Allen, Miss. Elisabeth Walton
1          1         1                   Allison, Master. Hudson Trevor
2          1         0                     Allison, Miss. Helen Loraine
3          1         0             Allison, Mr. Hudson Joshua Creighton
4          1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
...      ...       ...                                              ...
1304       3         0                             Zabour, Miss. Hileni
1305       3         0                            Zabour, Miss. Thamine
1306       3         0                        Zakarian, Mr. Mapriededer
1307       3         0                              Zakarian, Mr. Ortin
1308       3         0                               Zimmerman, Mr. Leo

      gender        age  sibsp  parch  ticket    fare embarked
0     female  29.000000      0      0   24160  211.34        S
1       male   0.916700      1      2  113781  151.55        S
2     female   2.000000      1      2  113781  151.55        S
3       male  30.000000      1      2  113781  151.55        S
4     female  25.000000      1      2  113781  151.55        S
...      ...        ...    ...    ...     ...     ...      ...
1304  female  14.500000      1      0    2665   14.45        C
1305  female  29.881135      1      0    2665   14.45        C
1306    male  26.500000      0      0    2656    7.23        C
1307    male  27.000000      0      0    2670    7.23        C
1308    male  29.000000      0      0  315082    7.88        S

[1309 rows x 10 columns]>

In [14]:
df.dropna(subset=["embarked"],inplace=True)
print (df.isna().sum())

pclass      0
survived    0
name        0
gender      0
age         0
sibsp       0
parch       0
ticket      0
fare        0
embarked    0
dtype: int64

In [15]:
df.to_csv('titanic_filtered.csv',index=True)

In [16]:
df['survived'].replace({1:"A",0:"D"},inplace=True)

In [17]:
df["survived"]

0       A
1       A
2       D
3       D
4       D
       ..
1304    D
1305    D
1306    D
1307    D
1308    D
Name: survived, Length: 1307, dtype: object

In [29]:
print(df["survived"].value_counts())

D    809
A    498
Name: survived, dtype: int64

In [28]:
print(df.groupby(['survived','gender']).size())

survived  gender
A         female    337
          male      161
D         female    127
          male      682
dtype: int64

In [35]:
df.pclass.value_counts()

3    709
1    321
2    277
Name: pclass, dtype: int64

In [47]:
display(df.sort_values(by='age',ascending=False).head(n=5))
print(df.sort_values(by='age',ascending=False).head(n=5).gender.value_counts())

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,embarked
14,1,A,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.00,S
61,1,A,"Cavendish, Mrs. Tyrell William (Julia Florence...",female,76.0,1,0,19877,78.85,S
1235,3,D,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.78,S
135,1,D,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.65,C
9,1,D,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.50,C

male      4
female    1
Name: gender, dtype: int64

In [54]:
df.age['gender'=='male']

KeyError: False